texts = {
    "en": {
        "changed": """Language has changed to 🇬🇧<b>EN</b>

<b>{users}</b> users are using this bot. 

<b>{passwords}</b> passwords encrypted.
<b>{messages}</b> messages received.""",
        "explain": """This bot can solve any <b>Valid</b> Sudoku, just pass an input as in example:
(empty cells are 0)
<pre>
5, 3, 0, 0, 7, 0, 0, 0, 0, 
6, 0, 0, 1, 9, 5, 0, 0, 0, 
0, 9, 8, 0, 0, 0, 0, 6, 0, 
8, 0, 0, 0, 6, 0, 0, 0, 3,
4, 0, 0, 8, 0, 3, 0, 0, 1, 
7, 0, 0, 0, 2, 0, 0, 0, 6, 
0, 6, 0, 0, 0, 0, 2, 8, 0, 
0, 0, 0, 4, 1, 9, 0, 0, 5, 
0, 0, 0, 0, 8, 0, 0, 7, 9,
</pre>
OR 
<pre>
5 3 0 0 7 0 0 0 0 
6 0 0 1 9 5 0 0 0 
0 9 8 0 0 0 0 6 0 
8 0 0 0 6 0 0 0 3
4 0 0 8 0 3 0 0 1 
7 0 0 0 2 0 0 0 6 
0 6 0 0 0 0 2 8 0 
0 0 0 4 1 9 0 0 5 
0 0 0 0 8 0 0 7 9  
</pre>
OR 
<pre>
5.3.0.0.7.0.0.0.0 
6.0.0.1.9.5.0.0.0 
0.9.8.0.0.0.0.6.0 
8.0.0.0.6.0.0.0.3
4.0.0.8.0.3.0.0.1 
7.0.0.0.2.0.0.0.6 
0.6.0.0.0.0.2.8.0 
0.0.0.4.1.9.0.0.5 
0.0.0.0.8.0.0.7.9  
</pre>
""",
        "start": "This bot is designed to solve sudoku. Choose the language and start solving.",

        "enter": """Enter your input""",
        "wrong": "Error in the input: \n<pre>{}</pre>"
    },
    "ru": {
        "changed": """Язык был изменен на 🇷🇺<b>RU</b>

<b>{users}</b> Пользователей используют этого бота.
<b>{passwords}</b> паролей зашифровано.
<b>{messages}</b> сообщений обработано.
 """,
        "explain": """Этот бота может решить любое <b>правильное</b> Судоку, просто введите в него значения как в примере:
(пустые ячейки - 0)
<pre>
5, 3, 0, 0, 7, 0, 0, 0, 0, 
6, 0, 0, 1, 9, 5, 0, 0, 0, 
0, 9, 8, 0, 0, 0, 0, 6, 0, 
8, 0, 0, 0, 6, 0, 0, 0, 3,
4, 0, 0, 8, 0, 3, 0, 0, 1, 
7, 0, 0, 0, 2, 0, 0, 0, 6, 
0, 6, 0, 0, 0, 0, 2, 8, 0, 
0, 0, 0, 4, 1, 9, 0, 0, 5, 
0, 0, 0, 0, 8, 0, 0, 7, 9,
</pre>
OR 
<pre>
5 3 0 0 7 0 0 0 0 
6 0 0 1 9 5 0 0 0 
0 9 8 0 0 0 0 6 0 
8 0 0 0 6 0 0 0 3
4 0 0 8 0 3 0 0 1 
7 0 0 0 2 0 0 0 6 
0 6 0 0 0 0 2 8 0 
0 0 0 4 1 9 0 0 5 
0 0 0 0 8 0 0 7 9  
</pre>
OR 
<pre>
5.3.0.0.7.0.0.0.0 
6.0.0.1.9.5.0.0.0 
0.9.8.0.0.0.0.6.0 
8.0.0.0.6.0.0.0.3
4.0.0.8.0.3.0.0.1 
7.0.0.0.2.0.0.0.6 
0.6.0.0.0.0.2.8.0 
0.0.0.4.1.9.0.0.5 
0.0.0.0.8.0.0.7.9  
</pre>
""",
        "start": "Этот бот создан, чтобы решать судоку. Выберите язык и начинайте!",
        "enter": """Введите исходные данные""",
        "wrong": "Ошибка в исходных данных: \n<pre>{}</pre>"
    }
}

